toasterllc/MDCCode/Code/STM32/STApp/Source/main.cpp
    // Send status
    _System::USBSendStatus(true);
    _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
    
    // Send ImgCaptureStats
    _USB.send(Endpoints::DataIn, &stats, sizeof(stats));
    _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
    
    // Arrange for the image to be read out
    _ICE::Transfer(_ICE::ImgReadoutMsg(arg.dstBlock));
    
    // Start the Readout task
    _TaskReadout::Start(stats.len);
}

static void _CmdHandle(const STM::Cmd& cmd) {
    switch (cmd.op) {
    // ICE40 Bootloader
    case Op::ICEWrite:          _ICEWrite(cmd);                 break;
    // MSP430 Bootloader
    case Op::MSPConnect:        _MSPConnect(cmd);               break;
    case Op::MSPDisconnect:     _MSPDisconnect(cmd);            break;
    // MSP430 Debug
    case Op::MSPRead:           _MSPRead(cmd);                  break;
    case Op::MSPWrite:          _MSPWrite(cmd);                 break;
    case Op::MSPDebug:          _MSPDebug(cmd);                 break;
    // SD Card
    case Op::SDCardIdGet:       _SDCardIdGet(cmd);              break;
    case Op::SDCardDataGet:     _SDCardDataGet(cmd);            break;
    case Op::SDRead:            _SDRead(cmd);                   break;
    // Img
    case Op::ImgCapture:        _ImgCapture(cmd);               break;
    case Op::ImgExposureSet:    _ImgExposureSet(cmd);           break;
    // Bad command
    default:                    _System::USBSendStatus(false);  break;
    }
}

// MARK: - ISRs

extern "C" __attribute__((section(".isr"))) void ISR_NMI() {}
extern "C" __attribute__((section(".isr"))) void ISR_HardFault() { for (;;); }
extern "C" __attribute__((section(".isr"))) void ISR_MemManage() { for (;;); }
extern "C" __attribute__((section(".isr"))) void ISR_BusFault() { for (;;); }
extern "C" __attribute__((section(".isr"))) void ISR_UsageFault() { for (;;); }
extern "C" __attribute__((section(".isr"))) void ISR_SVC() {}
extern "C" __attribute__((section(".isr"))) void ISR_DebugMon() {}
extern "C" __attribute__((section(".isr"))) void ISR_PendSV() {}

extern "C" __attribute__((section(".isr"))) void ISR_SysTick() {
    _Scheduler::Tick();
    HAL_IncTick();
}

extern "C" __attribute__((section(".isr"))) void ISR_OTG_HS() {
    _USB.isr();
}

extern "C" __attribute__((section(".isr"))) void ISR_QUADSPI() {
    _QSPI.isrQSPI();
}

extern "C" __attribute__((section(".isr"))) void ISR_DMA2_Stream7() {
    _QSPI.isrDMA();
}

// MARK: - Abort

extern "C" [[noreturn]]
void abort() {
    _System::Abort();
}

// MARK: - Main

int main() {
    _System::Init();
    
    __HAL_RCC_GPIOI_CLK_ENABLE(); // ICE_CRST_, ICE_CDONE
    
    _USB.init();
    _QSPI.init();
    
    _ICE_ST_SPI_CS_::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH, 0);
    _ICE_ST_SPI_CS_::Write(1);
    
    _ICE::Init();
    _MSPInit();
    
    _Scheduler::Run();
    return 0;
}


#warning TODO: remove these debug symbols
#warning TODO: when we remove these, re-enable: Project > Optimization > Place [data/functions] in own section
constexpr auto& _Debug_Tasks              = _Scheduler::_Tasks;
constexpr auto& _Debug_DidWork            = _Scheduler::_DidWork;
constexpr auto& _Debug_CurrentTask        = _Scheduler::_CurrentTask;
constexpr auto& _Debug_CurrentTime        = _Scheduler::_ISR.CurrentTime;
constexpr auto& _Debug_Wake               = _Scheduler::_ISR.Wake;
constexpr auto& _Debug_WakeTime           = _Scheduler::_ISR.WakeTime;
